In [1]:
print("Alô Mundo!")

Alô Mundo!

In [2]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\ead\desktop\aulas python leandro\semanadatascience\.venv\lib\site-packages (2.0.32)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\ead\desktop\aulas python leandro\semanadatascience\.venv\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\ead\desktop\aulas python leandro\semanadatascience\.venv\lib\site-packages (from sqlalchemy) (3.0.3)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\ead\desktop\aulas python leandro\semanadatascience\.venv\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ead\desktop\aulas python leandro\semanadatascience\.venv\lib\site-packages (from pandas) (2.0.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ead\desktop\aulas python leandro\semanadatascience\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ead\desktop\aulas python leandro\semanadatascience\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ead\desktop\aulas python leandro\semanadatascience\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\ead\desktop\aulas python leandro\semanadatascience\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 24.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [4]:
import pandas as pd

In [5]:
# Módulo
from sqlalchemy import create_engine

In [6]:
! pip install pymysql

Requirement already satisfied: pymysql in c:\users\ead\desktop\aulas python leandro\semanadatascience\.venv\lib\site-packages (1.1.1)

[notice] A new release of pip is available: 24.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [7]:
import pymysql

In [8]:
import urllib.parse

In [9]:
# Definir as credenciais:
user = 'root'
password = urllib.parse.quote_plus('senai@123')
host = 'localhost'
database = 'schooltracker'

# Criar uma url de conexão:
connection_string = f'mysql+pymysql://{user}:{password}@{host}/{database}'

# Criar a conexão com o create_engine()
engine = create_engine(connection_string)


# Escrever uma consulta SQL
query_alunos = "SELECT * FROM aluno"

# criar o dataframe
df_alunos =pd.read_sql(query_alunos,engine)

# Mostrar os cinco primeiros
df_alunos.head()

    id        ra  nome  rendafamiliar  Tempo_de_estudo
0  103  00034547  None            NaN                0
1  104  00034548  None            NaN                0
2  105  00034550  None            NaN                0
3  106  00034551  None            NaN                0
4  107  00034552  None            NaN                0

# Quais bibliotecas um cientista de dados utiliza?

- Pandas
- NumPy
- Fundamentos de IA (Scikit- Learn)

- Material Didático
- Pandas e NumPy (Notebook)
- Scikit- Learn (Apostila do SENAI)


# Pandas: ciência de dados

# Scikit- Learn: elaboração de modelos de IA

# NumPy: matemática

05/08/2024

- Carregar dados (ok)

- Salvar um dataframe

In [10]:
csv_filename = 'alunos.csv'
df_alunos.to_csv('alunos.csv', index=False)

In [11]:
csv_filename = 'api_alunos.json'
df_alunos.to_json('alunos.json', index=False)

In [12]:
! pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\ead\desktop\aulas python leandro\semanadatascience\.venv\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\ead\desktop\aulas python leandro\semanadatascience\.venv\lib\site-packages (from openpyxl) (1.1.0)

[notice] A new release of pip is available: 24.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [13]:
csv_filename = 'planilhas_alunos.xlsx'
df_alunos.to_excel(csv_filename,index=False)

# Um novo Dataframe

In [14]:
df_alunos.columns

Index(['id', 'ra', 'nome', 'rendafamiliar', 'Tempo_de_estudo'], dtype='object')

In [15]:
df_tempo_renda = df_alunos[['rendafamiliar','Tempo_de_estudo']]

# Para apresentar todos os dados = primeiro item : último item
df_tempo_renda

     rendafamiliar  Tempo_de_estudo
0              NaN                0
1              NaN                0
2              NaN                0
3              NaN                0
4              NaN                0
..             ...              ...
104        1120.90                3
105        1230.45                4
106        1370.60                5
107        1550.80                6
108         920.70                2

[109 rows x 2 columns]

# Tipos

In [16]:
print(type(df_tempo_renda))

<class 'pandas.core.frame.DataFrame'>

# Exercício: crie um recurso para mostrar apenas uma coluna. Mostre qual o tipo desse recurso.

In [17]:
serie_tempo_renda = df_tempo_renda['rendafamiliar']

In [18]:
type(serie_tempo_renda)

pandas.core.series.Series

# Revisando Funções Básicas

## - Exercício 01: retorne o dataframe da última aula com as duas primeiras linhas como amostra.
dataframe_df_tempo_renda

In [19]:
df_tempo_renda.head(2)

   rendafamiliar  Tempo_de_estudo
0            NaN                0
1            NaN                0

## - Exercício 02: agora retorne as duas últimas linhas da amostra.
dataframe_df_tempo_renda

In [20]:
df_tempo_renda.tail(2)

     rendafamiliar  Tempo_de_estudo
107         1550.8                6
108          920.7                2

## - Exercício 03: retorne uma tupla com número de linhas e colunas.
dataframe_df_tempo_renda

In [21]:
df_tempo_renda.shape

(109, 2)

## - Exercício 04: retorne as informações gerais do dataframe.
dataframe_df_tempo_renda

In [22]:
df_tempo_renda.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109 entries, 0 to 108
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   rendafamiliar    58 non-null     float64
 1   Tempo_de_estudo  109 non-null    int64
dtypes: float64(1), int64(1)
memory usage: 1.8 KB

In [23]:
qtde = len(df_tempo_renda)
if qtde <= 109:
    print(f"quantidade:{qtde} dentro do ideal")

quantidade:109 dentro do ideal

## - Exercício 05: retorne as colunas.
dataframe_df_tempo_renda

In [24]:
df_tempo_renda.columns

Index(['rendafamiliar', 'Tempo_de_estudo'], dtype='object')

## - Exercício 06: retorne as informações apenas da coluna rendafamiliar.
dataframe_df_tempo_renda

In [25]:
df_tempo_renda['rendafamiliar'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 109 entries, 0 to 108
Series name: rendafamiliar
Non-Null Count  Dtype
--------------  -----
58 non-null     float64
dtypes: float64(1)
memory usage: 1004.0 bytes

## - Exercício 07: Mostre os tipos com dtypes
dataframe_df_tempo_renda

In [26]:
df_alunos.dtypes

id                   int64
ra                  object
nome                object
rendafamiliar      float64
Tempo_de_estudo      int64
dtype: object

- Estatística

In [27]:
df_alunos.describe()

               id  rendafamiliar  Tempo_de_estudo
count  109.000000      58.000000       109.000000
mean   159.082569    1434.463276         2.009174
std     33.358082    1108.149374         2.200570
min    103.000000     920.700000         0.000000
25%    130.000000    1080.637500         0.000000
50%    161.000000    1255.600000         2.000000
75%    188.000000    1415.587500         4.000000
max    215.000000    8901.230000         6.000000

## - Exercício 08: Crie um dataframe da tabela diário de bordo
dataframe_df_tempo_renda

In [28]:
# Definir as credenciais:
user = 'root'
password = urllib.parse.quote_plus('senai@123')
host = 'localhost'
database = 'schooltracker'

# Criar uma url de conexão:
connection_string = f'mysql+pymysql://{user}:{password}@{host}/{database}'

# Criar a conexão com o create_engine()
engine = create_engine(connection_string)


# Escrever uma consulta SQL
query_diariobordo = "SELECT * FROM diariobordo"

# criar o dataframe
df_diariobordo =pd.read_sql(query_diariobordo,engine)

# Mostrar os cinco primeiros
df_diariobordo.head()

,id,texto,datahora,fk_aluno_id
0,1,Estudo de DataScience - Revisão de Introdução ...,2024-07-31 15:55:00,103
1,2,Estudo de DataScience - Revisão de Introdução ...,2024-07-31 15:55:00,103
2,3,Na Aula de hoje abordamos sobre o INSERT em SQ...,2024-07-31 17:50:00,154
3,7,Estudo de estatística para ciência de dados,2024-07-31 13:00:00,104
4,8,Sessão de codificação em R,2024-07-31 14:15:00,105

In [29]:
df_diariobordo.head(2)

,id,texto,datahora,fk_aluno_id
0,1,Estudo de DataScience - Revisão de Introdução ...,2024-07-31 15:55:00,103
1,2,Estudo de DataScience - Revisão de Introdução ...,2024-07-31 15:55:00,103

In [30]:
df_diariobordo.tail(2)

,id,texto,datahora,fk_aluno_id
51,55,Revisão de modelos probabilísticos,2024-08-07 10:45:00,152
52,58,Análise de algoritmos de classificação,2024-08-07 12:00:00,164

In [31]:
df_diariobordo.shape

(53, 4)

In [32]:
df_diariobordo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53 entries, 0 to 52
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           53 non-null     int64
 1   texto        53 non-null     object
 2   datahora     53 non-null     datetime64[ns]
 3   fk_aluno_id  53 non-null     int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 1.8+ KB

In [33]:
qtde = len(df_diariobordo)
if qtde <= 4:
    print(f"quantidade:{qtde} dentro do ideal")

In [34]:
df_diariobordo.columns

Index(['id', 'texto', 'datahora', 'fk_aluno_id'], dtype='object')

In [35]:
df_diariobordo['texto'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 53 entries, 0 to 52
Series name: texto
Non-Null Count  Dtype
--------------  -----
53 non-null     object
dtypes: object(1)
memory usage: 556.0+ bytes

In [36]:
df_diariobordo.dtypes

id                      int64
texto                  object
datahora       datetime64[ns]
fk_aluno_id             int64
dtype: object

In [37]:
df_diariobordo.describe()

              id                       datahora  fk_aluno_id
count  53.000000                             53    53.000000
mean   29.867925  2024-08-03 19:37:49.811320832   128.226415
min     1.000000            2024-07-31 13:00:00   103.000000
25%    17.000000            2024-08-01 16:00:00   115.000000
50%    30.000000            2024-08-03 14:45:00   128.000000
75%    43.000000            2024-08-05 13:30:00   141.000000
max    58.000000            2024-08-07 12:00:00   164.000000
std    15.802918                            NaN    15.823111

## Dataframe da tabela Avaliação

In [38]:
# Definir as credenciais:
user = 'root'
password = urllib.parse.quote_plus('senai@123')
host = 'localhost'
database = 'schooltracker'

# Criar uma url de conexão:
connection_string = f'mysql+pymysql://{user}:{password}@{host}/{database}'

# Criar a conexão com o create_engine()
engine = create_engine(connection_string)


# Escrever uma consulta SQL
query_avaliacao = "SELECT * FROM avaliacao"

# criar o dataframe
df_avaliacao =pd.read_sql(query_avaliacao,engine)

# Mostrar os cinco primeiros
df_avaliacao.head()

   id  nota1  nota2  nota3  nota4  fk_aluno_id
0   1     19     25     20     15          103
1   2     19     25     20     15          103
2   3     13     18     12     24          104
3   4     10     20     18     25          105
4   5     17     13     19     21          106

In [39]:
df_avaliacao.head(2)

   id  nota1  nota2  nota3  nota4  fk_aluno_id
0   1     19     25     20     15          103
1   2     19     25     20     15          103

In [40]:
df_avaliacao.tail(2)

   id  nota1  nota2  nota3  nota4  fk_aluno_id
4   5     17     13     19     21          106
5   6      9     23     16     22          107

In [41]:
df_avaliacao.shape

(6, 6)

In [42]:
df_avaliacao.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           6 non-null      int64
 1   nota1        6 non-null      int64
 2   nota2        6 non-null      int64
 3   nota3        6 non-null      int64
 4   nota4        6 non-null      int64
 5   fk_aluno_id  6 non-null      int64
dtypes: int64(6)
memory usage: 420.0 bytes

In [43]:
qtde = len(df_avaliacao)
if qtde <= 6:
    print(f"quantidade:{qtde} dentro do ideal")

quantidade:6 dentro do ideal

In [44]:
df_avaliacao.columns

Index(['id', 'nota1', 'nota2', 'nota3', 'nota4', 'fk_aluno_id'], dtype='object')

In [45]:
df_avaliacao['nota1'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 6 entries, 0 to 5
Series name: nota1
Non-Null Count  Dtype
--------------  -----
6 non-null      int64
dtypes: int64(1)
memory usage: 180.0 bytes

In [46]:
df_avaliacao.dtypes

id             int64
nota1          int64
nota2          int64
nota3          int64
nota4          int64
fk_aluno_id    int64
dtype: object

In [47]:
df_avaliacao.describe()

             id      nota1      nota2      nota3      nota4  fk_aluno_id
count  6.000000   6.000000   6.000000   6.000000   6.000000     6.000000
mean   3.500000  14.500000  20.666667  17.500000  20.333333   104.666667
std    1.870829   4.460942   4.676181   3.082207   4.366539     1.632993
min    1.000000   9.000000  13.000000  12.000000  15.000000   103.000000
25%    2.250000  10.750000  18.500000  16.500000  16.500000   103.250000
50%    3.500000  15.000000  21.500000  18.500000  21.500000   104.500000
75%    4.750000  18.500000  24.500000  19.750000  23.500000   105.750000
max    6.000000  19.000000  25.000000  20.000000  25.000000   107.000000

## - Exercício 09: Faça um JOIN no Pandas similar ao que fez no SQL

In [48]:
len(df_diariobordo)

53

In [49]:
len(df_alunos)

109

In [51]:
# Fatiamento
df_diariobordo[10:20]

,id,texto,datahora,fk_aluno_id
10,14,Análise de casos de uso de DataScience,2024-08-01 12:00:00,111
11,15,Revisão de métodos de validação de modelo,2024-08-01 13:30:00,112
12,16,Prática com conjuntos de dados do Kaggle,2024-08-01 14:45:00,113
13,17,Estudo de técnicas de feature engineering,2024-08-01 16:00:00,114
14,18,Revisão de bibliotecas de machine learning,2024-08-02 08:00:00,115
15,19,Sessão de limpeza e pré-processamento de dados,2024-08-02 09:30:00,116
16,20,Exploração de modelos de classificação,2024-08-02 10:45:00,117
17,21,Estudo sobre métricas de desempenho,2024-08-02 12:00:00,118
18,22,Implementação de validação cruzada,2024-08-02 13:30:00,119
19,23,Análise de gráficos de dispersão,2024-08-02 14:45:00,120

## Vamos fazer um JOIN?

### Passos para o merge
 - Use o comando merge
 - Crie uma variável - pode ser resultado o nome
 - pd.merge(daframe,dataframe2,tipo_uniao,qual a chave da esquerda, qual a chave da direita) - queremos unir
 - Qual tipo de união: how='inner'
 - O parâmetro how define o tipo de join que estamos realizando.
 - inner significa que queremos um join interno, o que resulta em apenas as linhas que têm correspondência em ambos os Dataframes.

In [55]:
# Realizar o JOIN
resultado = pd.merge(df_diariobordo,df_alunos, how='left', left_on='fk_aluno_id',right_on='id')

# Selecionar as colunas desejadas
resultado_selecionado = resultado[['texto', 'datahora', 'ra']]

# Mostrar o resultado
resultado.head()

,id_x,texto,datahora,fk_aluno_id,id_y,ra,nome,rendafamiliar,Tempo_de_estudo
0,1,Estudo de DataScience - Revisão de Introdução ...,2024-07-31 15:55:00,103,103,00034547,None,NaN,0
1,2,Estudo de DataScience - Revisão de Introdução ...,2024-07-31 15:55:00,103,103,00034547,None,NaN,0
2,3,Na Aula de hoje abordamos sobre o INSERT em SQ...,2024-07-31 17:50:00,154,154,00174292,None,NaN,0
3,7,Estudo de estatística para ciência de dados,2024-07-31 13:00:00,104,104,00034548,None,NaN,0
4,8,Sessão de codificação em R,2024-07-31 14:15:00,105,105,00034550,None,NaN,0

# Crie uma junção do dataframe aluno com avaliação. Mostre as notas e o RA do aluno.

In [70]:
# Realizar o JOIN
resultado = pd.merge(df_avaliacao,df_alunos, how='inner', left_on='fk_aluno_id',right_on='id')

# Selecionar as colunas desejadas
resultado_selecionado = resultado[['nota1', 'nota2', 'nota3', 'nota4', 'ra']]

# Mostrar o resultado
resultado_selecionado.head()

   nota1  nota2  nota3  nota4        ra
0     19     25     20     15  00034547
1     19     25     20     15  00034547
2     13     18     12     24  00034548
3     10     20     18     25  00034550
4     17     13     19     21  00034551

In [72]:
len(resultado_selecionado)

6

In [74]:
resultado_selecionado.tail()

   nota1  nota2  nota3  nota4        ra
1     19     25     20     15  00034547
2     13     18     12     24  00034548
3     10     20     18     25  00034550
4     17     13     19     21  00034551
5      9     23     16     22  00034552

# NumPy

# Pandas(funções agregadas)